tests/xma40provisioning/updateUserGroupMemberExpiry.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://provisioning.intf.mobilgw.com/">
  <soap:Body>
    <tns:updateUserGroupMemberExpiry>
      <arg0>     
		<attributes>
         <name>ExpiryDate</name>
         <value>-1</value>
         </attributes>
		 <userId>1234567890</userId>
         <userGroupName>HelloGrp</userGroupName></arg0>
      <arg1>1</arg1>
      </tns:updateUserGroupMemberExpiry>
  </soap:Body>
</soap:Envelope>